busterb/openbsd-src/usr.sbin/btrace/bt.5
.\"	$OpenBSD: bt.5,v 1.17 2023/10/22 19:30:35 cheloha Exp $
.\"
.\" Copyright (c) 2019 Martin Pieuchot <mpi@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: October 22 2023 $
.Dt BT 5
.Os
.Sh NAME
.Nm BT
.Nd Bug Tracing language
.Sh SYNTAX
.D1 Ar probe Ic \&/ Ar filter Ic \&/ \&{ Ar action Ic \&}
.Sh DESCRIPTION
The
.Nm
language, also known as BPFtrace syntax, describes how to format and display
information gathered from specified
.Ar probe
events.
.Pp
Events are generated by the dynamic tracer
.Xr dt 4
when an enabled
.Ar probe
is triggered.
They are periodically collected by
.Xr btrace 8 ,
which formats them using the corresponding
.Ar action .
If a recorded event doesn't match the optional
.Ar filter ,
it will be silently ignored.
.Pp
A valid
.Nm
source file contains at least one
.Ar probe
clause associated with an
.Ar action
statement.
.Sh PROBE
The list of available probes may vary from system to system and can be queried
with
.Xr btrace 8 .
.Pp
The special probes
.Ic BEGIN
and
.Ic END
may be used to manipulate states before the first event is recorded and after
the last.
They cannot be combined with any
.Ar filter .
.Pp
The following providers are available:
.Bl -tag -width "tracepoint"
.It Cm syscall
Trace system call entry and return points.
Probe format:
.Ic syscall : Ns Ar name Ns Ic :entry
or
.Ic syscall : Ns Ar name Ns Ic :return .
.It Cm kprobe
Trace kernel function entry points.
Probe format:
.Ic kprobe : Ns Ar func .
.It Cm kretprobe
Trace kernel function return points, capturing the return value.
Probe format:
.Ic kretprobe : Ns Ar func .
The
.Va retval
variable contains the function's return value.
.It Cm profile
Periodic sampling timer that fires on all CPUs.
Probe format:
.Ic profile : Ns Ar unit Ns Ic \&: Ns Ar value .
.It Cm interval
Periodic timer that fires on a single CPU.
Probe format:
.Ic interval : Ns Ar unit Ns Ic \&: Ns Ar value .
.It Cm tracepoint
Static kernel tracepoints.
.El
.Pp
The
.Cm profile
and
.Cm interval
probes accept the following timer units:
.Pp
.Bl -tag -width "hz" -compact -offset indent
.It Cm hz
frequency in Hertz
.It Cm us
microseconds
.It Cm ms
milliseconds
.It Cm s
seconds
.El
.Pp
Probe names may contain the wildcard characters
.Ql *
and
.Ql \&? ,
which are matched using
.Xr fnmatch 3 .
A single probe clause with wildcards expands to all matching probes.
For example:
.Pp
.Dl kprobe:*alloc*
.Pp
matches all kernel functions containing
.Dq alloc
at entry.
.Sh FILTER
Define under which condition an event should be recorded when its related
.Ar probe
is executed.
An empty
.Ar filter
means record all events.
.Pp
Variable names available in filters:
.Pp
.Bl -tag -width "kstack " -compact -offset indent
.It Va pid
Process ID of the current thread.
.It Va tid
Thread ID of the current thread.
.El
.Sh ACTION
An action is a sequence of statements that are evaluated for each event recorded
by the associated
.Ar probe .
.Pp
Variable names with special meaning:
.Pp
.Bl -tag -width "kstack " -compact -offset indent
.It Va $N
Command line argument
.Va N
after the script name.
.It Va argN
Argument
.Va N
of the corresponding probe.
.It Va comm
Command name of the current process.
.It Va cpu
ID of the processor that recorded the event.
.It Va elapsed
Nanoseconds elapsed since tracing began.
.It Va gid
Group ID of the current process.
.It Va kstack
Kernel stack of the current thread.
.It Va nsecs
Timestamp of the event in nanoseconds.
.It Va pid
Process ID of the current thread.
.It Va probe
Full name of the probe.
.It Va retval
Return value of the traced syscall or
.Cm kretprobe
return probe.
.It Va tid
Thread ID of the current thread.
.It Va uid
User ID of the current process.
.It Va ustack
Userland stack of the current thread.
.El
.Pp
When CTF (Compact C Type Format) data is available in
.Pa /bsd ,
the
.Va arg0
through
.Va arg9
and
.Va retval
variables are automatically formatted according to their C types:
signed integers as decimal, unsigned integers as hexadecimal when large,
pointers as
.Dq Li (struct foo *)0xaddr ,
enums by name, and characters as quoted literals.
.Pp
Functions:
.Bl -tag -width "lhist(value, min, max, step)"
.It Fn clear "@map"
Delete all (key, value) pairs from
.Va @map .
.It Fn delete "@map[key]"
Delete the pair indexed by
.Va key
from
.Va @map .
.It Fn exit
Terminate execution with exit code 0.
The
.Ic END
probe,
if any,
is executed and the contents of all non-empty maps are printed.
.It Fn hist "value"
Increment the bucket corresponding to
.Va value
in a power-of-two histogram.
Used as
.Ql \&@ = hist(value)
for a scalar histogram, or
.Ql \&@map[key] = hist(value)
for a per-key histogram.
.It Fn lhist "value" "min" "max" "step"
Increment the bucket corresponding to
.Va value
in the linear histogram spanning between the positive value
.Va min
and
.Va max
with buckets of
.Va step
size.
Used as
.Ql \&@ = lhist(value, min, max, step)
for a scalar histogram, or
.Ql \&@map[key] = lhist(value, min, max, step)
for a per-key histogram.
.It Fn print "@map"
Print all pairs from
.Va @map .
.It Fn print "@map" n
Print only the first
.Va n
entries in
.Va @map .
.It Fn printf "fmt" ...
Print formatted string
.Va fmt .
.It Fn ksym "addr"
Return the kernel symbol name corresponding to
.Ar addr .
The address is looked up in the kernel symbol table loaded from
.Pa /bsd .
If no symbol is found at the exact address, the nearest symbol plus
its offset is returned.
If the symbol table is unavailable, the address is returned as a
hexadecimal string.
.It Fn usym "addr"
Return the userland symbol name corresponding to
.Ar addr
in the process that triggered the probe.
The shared library symbol tables are loaded on demand.
If no symbol is found, the address is returned as a hexadecimal string.
.It Fn sizeof "typename"
Return the size in bytes of the named C type, using type information
from CTF data in
.Pa /bsd .
.Ar typename
may include a
.Ic struct ,
.Ic union ,
or
.Ic enum
prefix.
If CTF data is unavailable or the type cannot be found, the value is 0.
.It Fn strncmp "s1" "s2" "len"
Compare the first
.Ar len
bytes of strings
.Ar s1
and
.Ar s2 .
Returns 0 if equal, a negative value if
.Ar s1
is less than
.Ar s2 ,
or a positive value if
.Ar s1
is greater than
.Ar s2 .
Useful in filter expressions.
.It Fn str "expr" "[maxlen]"
When
.Va expr
is a probe argument
.Pq Va arg0 No through Va arg9 ,
return the NUL-terminated string it points to.
The string is copied at probe fire time.
The copy direction is determined automatically: addresses below
.Dv VM_MAXUSER_ADDRESS
are copied from user address space using
.Xr copyinstr 9 ;
kernel addresses are copied using
.Xr kcopy 9 .
For any other expression,
.Va expr
is converted to a string representation at display time.
The result is truncated to
.Va maxlen
bytes (up to 1024, the default), including the NUL-terminator.
.It Ar argN Ic -> Ar field Oo Ic -> Ar field2 Oc ...
Dereference a struct member from a probe argument.
.Ar argN
must be a pointer to a struct or union.
.Ar field
names the member to capture.
The field value is read from kernel memory at probe fire time and stored
as a 64-bit integer.
The
.Ic ->
operator may be chained to follow pointer fields through multiple levels
of indirection:
.Ar argN Ic -> Ar ptr_field Ic -> Ar field2
first captures the pointer stored in
.Ar ptr_field ,
then reads
.Ar field2
from the struct it points to.
Subscript expressions may also appear as the base of
.Ic -> :
.Ar argN Ic \&[ Ar N Ic \&] Ic -> Ar field
reads element
.Ar N
of the array that
.Ar argN
points to and then captures
.Ar field
from that element.
Up to
.Dv DTMAXMEMCAPS
field captures may be active per probe across all dereference expressions.
Type information from CTF data in
.Pa /bsd
is used to determine field offsets and sizes.
If CTF data is unavailable or a field cannot be resolved, the value
is 0.
Currently only applies to
.Cm kprobe
and
.Cm syscall
probes.
.It Ar argN Ic \&[ Ar N Ic \&]
Read element
.Ar N
(a non-negative integer constant) from the array pointed to by
.Ar argN .
The element is read from kernel memory at probe fire time and stored as a
64-bit integer.
Type information from CTF data in
.Pa /bsd
is used to determine the element size (stride).
If CTF data is unavailable or the type is not a pointer, the value is 0.
Subscripts may be chained
.Pq Ar argN Ic \&[ Ar N Ic \&] Ic \&[ Ar M Ic \&]
and combined with
.Ic ->
in either order.
Currently only applies to
.Cm kprobe
and
.Cm syscall
probes.
.It Pq Ar type Ic * Ar expr Ic -> Ar field
Type cast: reinterpret
.Ar expr
as a pointer to
.Ar type
and dereference
.Ar field
from the resulting struct.
.Ar type
may be a one-word type
.Pq e.g. Ar sockaddr_in
or a two-word type with a
.Ic struct ,
.Ic union ,
or
.Ic enum
prefix.
The field is resolved using CTF data from
.Pa /bsd
as with uncast dereferences.
For example,
.Dl ((struct sockaddr_in *)arg1)->sin_addr
reinterprets
.Va arg1
as a
.Vt struct sockaddr_in *
and captures the
.Va sin_addr
field.
.It Fn time timefmt
Print timestamps using
.Xr strftime 3 .
.It Fn zero "@map"
Set all values from
.Va @map
to 0.
.El
.Pp
The following functions only work on a specific map entry.
.Bl -tag -width "lhist(value, min, max, step)"
.It Ic for Pq Ar $var : Ar @map No block
Iterate over all entries of
.Ar @map ,
executing
.Ar block
once per entry.
The loop variable
.Ar $var
is bound to a
.Pq Ar key , Ar value
tuple for each entry:
.Ar $var.0
is the key as a string and
.Ar $var.1
is the aggregated value.
Only maps with scalar aggregation values
.Pq count , sum , min , max , avg , stats
may be iterated.
.It Ic while Pq Ar expr No block
Execute
.Ar block
repeatedly as long as
.Ar expr
is non-zero.
Evaluation is capped at 1024 iterations per event to prevent runaway
loops from stalling the
.Xr btrace 8
process.
.It Ic break
Exit the innermost enclosing
.Ic while
or
.Ic for
loop immediately.
.It Ic continue
Skip the remainder of the current loop body and proceed to the next
iteration of the innermost enclosing
.Ic while
or
.Ic for
loop.
For a
.Ic while
loop the condition is re-evaluated; for a
.Ic for
loop the next map entry is processed.
.It Ar var Ic += Ar expr , Ar var Ic -= Ar expr , No ...
Compound assignment:
.Ar var
.Ic op=
.Ar expr
is equivalent to
.Ar var
.Ic =
.Ar var
.Ic op
.Ar expr .
The operators
.Ic += ,
.Ic -= ,
.Ic *= ,
.Ic /= ,
.Ic %= ,
.Ic &= ,
.Ic |= ,
.Ic ^= ,
.Ic <<= ,
and
.Ic >>=
are supported.
.Ar var
may be a local variable
.Pq Va $name ,
a global scalar variable
.Pq Va @name ,
or a map entry
.Pq Va @map[key] .
.It Ar var Ic ++ , Ar var Ic -- , Ic ++ Ar var , Ic -- Ar var
Increment or decrement
.Ar var
by one.
Equivalent to
.Ar var
.Ic +=
.Li 1
and
.Ar var
.Ic -=
.Li 1
respectively.
Both prefix and postfix forms are supported as statements;
there is no difference in evaluation order.
.Ar var
may be a local variable, global scalar variable, or map entry.
.It Ar cond Ic \&? Ar expr1 Ic \&: Ar expr2
Ternary expression: evaluates
.Ar cond ;
if non-zero, the result is
.Ar expr1 ,
otherwise
.Ar expr2 .
May appear anywhere an expression is accepted, including as a
.Fn printf
argument, a map key, or the right-hand side of an assignment.
The operator is right-associative:
.Ar a Ic \&? Ar b Ic \&: Ar c Ic \&? Ar d Ic \&: Ar e
is parsed as
.Ar a Ic \&? Ar b Ic \&: Pq Ar c Ic \&? Ar d Ic \&: Ar e .
.It "@map[key]" = Fn avg "value"
Store the running average of all recorded values for
.Va key .
When the map is printed, the computed average is displayed.
.It "@map[key]" = Fn count
Increase the stored value for
.Va key
by one.
.It "@map[key]" = Fn hist "value"
Increment the power-of-two histogram bucket corresponding to
.Va value
for
.Va key .
When the map is printed, a separate histogram is displayed for each key.
.It "@map[key]" = Fn lhist "value" "min" "max" "step"
Increment the linear histogram bucket corresponding to
.Va value
for
.Va key .
When the map is printed, a separate histogram is displayed for each key.
.It "@map[key]" = Fn max "value"
Store the maximum recorded value for
.Va key .
.It "@map[key]" = Fn min "value"
Store the minimum recorded value for
.Va key .
.It "@map[key]" = Fn stats "value"
Store the count, average, and total sum of all recorded values for
.Va key .
When the map is printed, all three are displayed on one line.
.It "@map[key]" = Fn sum "value"
Store the sum of all recorded values for
.Va key .
.El
.Sh EXAMPLES
Working examples are installed in
.Pa /usr/share/btrace/ :
.Pp
.Bl -tag -width "syscalllat.bt" -compact
.It Pa kalloc.bt
Trace kernel allocation functions with type-aware arguments.
.It Pa kfunctime.bt
Measure kernel function call duration.
.It Pa kprofile.bt
Kernel profiling via stack sampling.
.It Pa runqlat.bt
Measure run queue (scheduler) latency.
.It Pa syscalllat.bt
Histogram of syscall latency.
.It Pa syscount.bt
Count syscalls by process name.
.It Pa uvmcount.bt
Count calls to VM subsystem functions.
.El
.Sh SEE ALSO
.Xr awk 1 ,
.Xr dt 4 ,
.Xr btrace 8
.Rs
.\"%A First Last
.%T BPFtrace reference guide
.%U https://github.com/iovisor/bpftrace/blob/master/docs/reference_guide.md
.\"%D November 1, 1901
.Re
.Sh STANDARDS
The dialect
of the
.Nm
language described in this manual and supported by
.Xr btrace 8
is compatible with BPFtrace.
The syntax is similar to
.Xr awk 1
and dtrace.
